Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36048.svd
            <register>
               <name>ADCCON3</name>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>ADINSEL</name>
                     <description>Analog Input Select bits</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ADINSELSelect</name>
                        <enumeratedValue>
                           <name>TMP_SENSE</name>
                           <description>CTMU Temperature Sensor (internal AN11)</description>
                           <value>0x0B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VBATDIV2_SENSE</name>
                           <description>VBAT/2 (internal AN10)</description>
                           <value>0x0A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1P2V_SENSE</name>
                           <description>IVref 1.2V (internal AN9)</description>
                           <value>0x9</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BGREF</name>
                           <description>BandGap Reference (internal AN8)</description>
                           <value>0x8</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN7</name>
                           <description>AN7</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN6</name>
                           <description>AN6</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN5</name>
                           <description>AN5</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN4</name>
                           <description>AN4</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN3</name>
                           <description>AN3</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN2</name>
                           <description>AN2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN1</name>
                           <description>AN1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AN0</name>
                           <description>AN0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GSWTRG</name>
                     <description>Global Software Trigger bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>GSWTRGSelect</name>
                        <enumeratedValue>
                           <name>GSWTRG</name>
                           <description>Trigger conversion for ADC inputs that have selected the GSWTRG bit as either through the associated TRGSRC bits in the ADCTRGx registers or through the STRGSRC&lt;4:0&gt; bits in the ADCCON1 register the trigger signal</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_GSWTRG</name>
                           <description>Do not trigger an analog-to-digital conversion</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GLSWTRG</name>
                     <description>Global Level Software Trigger bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>GLSWTRGSelect</name>
                        <enumeratedValue>
                           <name>GLSWTRG</name>
                           <description>Trigger conversion for ADC inputs that have selected the GLSWTRG bit as the trigger signal</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_GLSWTRG</name>
                           <description>Do not trigger an analog-to-digital conversion</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RQCNVRT</name>
                     <description>Individual ADC Input Conversion Request bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>RQCNVRTSelect</name>
                        <enumeratedValue>
                           <name>IND_TRIGGER</name>
                           <description>Trigger the conversion of the selected ADC input as specified by the ADINSEL bits</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_TRIGGER</name>
                           <description>Do not trigger the conversion</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SAMP</name>
                     <description>Shared ADC7 Analog Input Sampling Enable bit </description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>SAMPSelect</name>
                        <enumeratedValue>
                           <name>SAMPLE</name>
                           <description>The ADC S&amp;H amplifier is sampling</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HOLD</name>
                           <description>The ADC S&amp;H amplifier is holding</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPDRDY</name>
                     <description>ADC Update Ready Status bit</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>UPDRDYSelect</name>
                        <enumeratedValue>
                           <name>UPDATE_RDY</name>
                           <description>ADC SFRs can be updated</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UPDATE_NOT_RDY</name>
                           <description>ADC SFRs cannot be updated</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UPDIEN</name>
                     <description>Update Ready Interrupt Enable bit</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>UPDIENSelect</name>
                        <enumeratedValue>
                           <name>INT_ON_UPDATE_RDY</name>
                           <description>Interrupt will be generated when the UPDRDY bit is set by hardware</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NO_INT_ON_UPDATE_RDY</name>
                           <description>No interrupt is generated</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGSUSP</name>
                     <description>Trigger Suspend bit</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>TRGSUSPSelect</name>
                        <enumeratedValue>
                           <name>TRIG_BLOCKED</name>
                           <description>Triggers are blocked from starting a new analog-to-digital conversion</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TRIG_NOT_BLOCKED</name>
                           <description>Triggers are not blocked</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>VREFSEL</name>
                     <description>Voltage Reference Input Selection bits</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>VREFSELSelect</name>
                        <enumeratedValue>
                           <name>AVDD_AVSS</name>
                           <description>ADC VREFH is AVDD, ADC VREFL is AVSS</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DIGEN7</name>
                     <description>Shared ADC (ADC7) Digital Enable bit</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONCLKDIV</name>
                     <description>Analog-to-Digital Control Clock Divider bits</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>ADCSEL</name>
                     <description>Analog-to-Digital Clock Source bits</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>ADCSELSelect</name>
                        <enumeratedValue>
                           <name>SYSCLK</name>
                           <description>SYSCLK</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFCLK3</name>
                           <description>REFCLK3</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FRC</name>
                           <description>FRC</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PBCLK1</name>
                           <description>PBCLK1</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
