Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36048.svd
            <register>
               <name>PB2DIV</name>
               <description>PB2 CLOCK DIVISOR CONTROL REGISTER</description>
               <addressOffset>0x140</addressOffset>
               <resetValue>0x8800</resetValue>
               <fields>
                  <field>
                     <name>PBDIV</name>
                     <description>PB2 Peripheral Clock Divisor Control value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PBDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide by 1 PB2 Clock same frequency as sys_clk</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2 PB2 Clock is 1/2 of sys_clk</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>Divide by 3 PB2 Clock is 1/3 of sys_clk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16 PB2 Clock is 1/16 of sys_clk</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV17</name>
                           <description>Divide by 17 PB2 Clock is 1/17 of sys_clk</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV127</name>
                           <description>Divide by 127 PB2 Clock is 1/127 of sys_clk</description>
                           <value>0x7e</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128 PB2 Clock is 1/128 of sys_clk</description>
                           <value>0x7f</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVRDY</name>
                     <description>PB2 Peripheral Clock Divisor Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PBDIVRDYSelect</name>
                        <enumeratedValue>
                           <name>PB2RDY</name>
                           <description>Indicates the PB clock divisor logic is not switching divisors and the PB2DIV may be written.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_PB2RDY</name>
                           <description>Indicates the PB clock divisor logic is currently switching values and the PB2DIV cannot be written.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PBDIVONSelect</name>
                        <enumeratedValue>
                           <name>PB2ON</name>
                           <description>PB2 Output clock is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PB2OFF</name>
                           <description>PB2 Output clock is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PB3DIV</name>
               <description>PB3 CLOCK DIVISOR CONTROL REGISTER</description>
               <addressOffset>0x150</addressOffset>
               <resetValue>0x8809</resetValue>
               <fields>
                  <field>
                     <name>PBDIV</name>
                     <description>PB3 Peripheral Clock Divisor Control value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PBDIVSelect</name>
                        <enumeratedValue>
                           <name>DIV1</name>
                           <description>Divide by 1 PB3 Clock same frequency as sys_clk</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV2</name>
                           <description>Divide by 2 PB3 Clock is 1/2 of sys_clk</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV3</name>
                           <description>Divide by 3 PB3 Clock is 1/3 of sys_clk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV16</name>
                           <description>Divide by 16 PB3 Clock is 1/16 of sys_clk</description>
                           <value>0xf</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV17</name>
                           <description>Divide by 17 PB3 Clock is 1/17 of sys_clk</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV127</name>
                           <description>Divide by 127 PB3 Clock is 1/127 of sys_clk</description>
                           <value>0x7e</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DIV128</name>
                           <description>Divide by 128 PB3 Clock is 1/128 of sys_clk</description>
                           <value>0x7f</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVRDY</name>
                     <description>PB3 Peripheral Clock Divisor Ready</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PBDIVRDYSelect</name>
                        <enumeratedValue>
                           <name>PB3RDY</name>
                           <description>Indicates the PB clock divisor logic is not switching divisors and the PB3DIV may be written.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>NOT_PB3RDY</name>
                           <description>Indicates the PB clock divisor logic is currently switching values and the PB3DIV cannot be written.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PBDIVON</name>
                     <description>Output Enable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>PBDIVONSelect</name>
                        <enumeratedValue>
                           <name>PB3ON</name>
                           <description>PB3 Output clock is enabled</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PB3OFF</name>
                           <description>PB3 Output clock is disabled</description>
                           <value>0x0</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PB1DIVCLR</name>
               <addressOffset>0x134</addressOffset>
            </register>
            <register>
               <name>PB1DIVSET</name>
               <addressOffset>0x138</addressOffset>
            </register>
            <register>
               <name>PB1DIVINV</name>
               <addressOffset>0x13C</addressOffset>
            </register>
            <register>
               <name>PB2DIVCLR</name>
               <addressOffset>0x144</addressOffset>
            </register>
            <register>
               <name>PB2DIVSET</name>
               <addressOffset>0x148</addressOffset>
            </register>
            <register>
               <name>PB2DIVINV</name>
               <addressOffset>0x14C</addressOffset>
            </register>
            <register>
               <name>PB3DIVCLR</name>
               <addressOffset>0x154</addressOffset>
            </register>
            <register>
               <name>PB3DIVSET</name>
               <addressOffset>0x158</addressOffset>
            </register>
            <register>
               <name>PB3DIVINV</name>
               <addressOffset>0x15C</addressOffset>
            </register>
