Ac6Embedded/svd-microchip/PIC32CX_BZ3/PIC32CX5109BZ36048.svd
               <register>
                  <name>RNG_DATA_FIFODEPTH</name>
                  <description>FIFO depth register.</description>
                  <addressOffset>0x400C</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>FIFODEPTH</name>
                        <description>Maximum number of 32 bits words that can be stored in the FIFO: 2**g_fifodepth.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_KEY0</name>
                  <description>Key register (MSB).</description>
                  <addressOffset>0x4010</addressOffset>
                  <fields>
                     <field>
                        <name>KEY0</name>
                        <description>Key register (MSB).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_KEY1</name>
                  <description>Key register.</description>
                  <addressOffset>0x4014</addressOffset>
                  <fields>
                     <field>
                        <name>KEY1</name>
                        <description>Key register.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_KEY2</name>
                  <description>Key register.</description>
                  <addressOffset>0x4018</addressOffset>
                  <fields>
                     <field>
                        <name>KEY2</name>
                        <description>Key register.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_KEY3</name>
                  <description>Key register (LSB).</description>
                  <addressOffset>0x401C</addressOffset>
                  <fields>
                     <field>
                        <name>KEY3</name>
                        <description>Key register (LSB).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_TESTDATA</name>
                  <description>Test data register.</description>
                  <addressOffset>0x4020</addressOffset>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>TESTDATA</name>
                        <description>Test data register.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_REPEATTHRESHOLD</name>
                  <description>Repetition Test Count Cut-Off value.</description>
                  <addressOffset>0x4024</addressOffset>
                  <fields>
                     <field>
                        <name>REPEATTHRESHOLD</name>
                        <description>Repetition Test Count Cut-Off value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_PROPTHRESHOLD</name>
                  <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
                  <addressOffset>0x4028</addressOffset>
                  <fields>
                     <field>
                        <name>PROPTHRESHOLD</name>
                        <description>Adaptive Proportion Test (1024-sample window) Cut-Off value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_STATUS</name>
                  <description>Status register.</description>
                  <addressOffset>0x4030</addressOffset>
                  <fields>
                     <field>
                        <name>TESTDATABUSY</name>
                        <description>High when data written to TestData register is being processed. (see section 4.7)</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STATE</name>
                        <description>State of the control FSM: 000: Reset, 001: Startup, 010: Idle (Rings On), 011: Idle (Rings Off), 100: Fill FIFO, 101: Error, 110: Unused, 111: Unused.</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>3</bitWidth>
                     </field>
                     <field>
                        <name>REPFAIL</name>
                        <description>NIST-800-90B repetition Count Test interrupt status.</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PROPFAIL</name>
                        <description>NIST-800-90B adaptive Proportion Test (1024-sample window) interrupt status.</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FULLINT</name>
                        <description>FIFO full status.</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PREINT</name>
                        <description>AIS31 preliminary noise alarm interrupt status.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ALMINT</name>
                        <description>AIS31 noise alarm interrupt status.</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>STARTUPFAIL</name>
                        <description>Start-up test failure.</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>FIFOACCFAIL</name>
                        <description>Set when a FIFO data read is performed while the NDRNG is disabled AND has its FIFO empty (FIFOLevel = 0).</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_INITWAITVAL</name>
                  <description>Initial wait counter value.</description>
                  <addressOffset>0x4034</addressOffset>
                  <resetValue>0x0000FFFF</resetValue>
                  <fields>
                     <field>
                        <name>INITWAITVAL</name>
                        <description>Number of clock cycles to wait before sampling data from the noise source.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_DISABLEOSC0</name>
                  <description>Disable oscillator rings #0 to #31.</description>
                  <addressOffset>0x4038</addressOffset>
                  <fields>
                     <field>
                        <name>DISABLEOSC0</name>
                        <description>Disable oscillator rings #0 to #31.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_DISABLEOSC1</name>
                  <description>Disable oscillator rings #32 to #63.</description>
                  <addressOffset>0x403C</addressOffset>
                  <fields>
                     <field>
                        <name>DISABLEOSC1</name>
                        <description>Disable oscillator rings #32 to #63.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>32</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_SWOFFTMRVAL</name>
                  <description>Switch off timer value.</description>
                  <addressOffset>0x4040</addressOffset>
                  <fields>
                     <field>
                        <name>SWOFFTMRVAL</name>
                        <description>Number of clk cycles to wait before stopping the rings after the FIFO is full.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_CLKDIV</name>
                  <description>Sample clock divider.</description>
                  <addressOffset>0x4044</addressOffset>
                  <fields>
                     <field>
                        <name>CLKDIV</name>
                        <description>Sample clock divider. The frequency at which the outputs of the rings are sampled is given by: Fs=Fpclk/(ClkDiv+1).</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_AIS31CONF0</name>
                  <description>AIS31 configuration register 0.</description>
                  <addressOffset>0x4048</addressOffset>
                  <fields>
                     <field>
                        <name>STARTUPTHRESHOLD</name>
                        <description>Start-up test threshold.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>ONLINETHRESHOLD</name>
                        <description>Online threshold.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_AIS31CONF1</name>
                  <description>AIS31 configuration register 1.</description>
                  <addressOffset>0x404C</addressOffset>
                  <fields>
                     <field>
                        <name>ONLINEREPTHRESHOLD</name>
                        <description>Online repeat threshold.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>HEXPECTEDVALUE</name>
                        <description>Expected history value.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_AIS31CONF2</name>
                  <description>AIS31 configuration register 2.</description>
                  <addressOffset>0x4050</addressOffset>
                  <fields>
                     <field>
                        <name>HMIN</name>
                        <description>Minimum allowed history value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>HMAX</name>
                        <description>Maximum allowed history value.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_AIS31STATUS</name>
                  <description>AIS31 status register.</description>
                  <addressOffset>0x4054</addressOffset>
                  <fields>
                     <field>
                        <name>NUMPRELIMALARMS</name>
                        <description>Number of preliminary noise alarms since counter was last cleared.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>PRELIMNOISEALARMRNG</name>
                        <description>Last preliminary noise alarm occurred due to history value out of range.</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PRELIMNOISEALARMREP</name>
                        <description>Last preliminary noise alarm occurred due to consecutive high X**2.</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>RNG_DATA_HWCONFIG</name>
                  <description>Hardware configuration register.</description>
                  <addressOffset>0x4058</addressOffset>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>NUMBOFRINGS</name>
                        <description>Generic g_NumRings value.</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                     <field>
                        <name>AIS31</name>
                        <description>Generic g_AIS31 value.</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AIS31FULL</name>
                        <description>Generic g_AIS31Full value.</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
